superdyzio/PWR-Stuff/AIR-ARR/Sterowniki Robotów/lab2/workspace/MC9S08LL64/Generated_Code/IO_Map.h
extern volatile ADCSC1STR _ADCSC1 @0x00000010;
#define ADCSC1                          _ADCSC1.Byte
#define ADCSC1_ADCH0                    _ADCSC1.Bits.ADCH0
#define ADCSC1_ADCH1                    _ADCSC1.Bits.ADCH1
#define ADCSC1_ADCH2                    _ADCSC1.Bits.ADCH2
#define ADCSC1_ADCH3                    _ADCSC1.Bits.ADCH3
#define ADCSC1_ADCH4                    _ADCSC1.Bits.ADCH4
#define ADCSC1_AIEN                     _ADCSC1.Bits.AIEN
#define ADCSC1_COCO                     _ADCSC1.Bits.COCO
#define ADCSC1_ADCH                     _ADCSC1.MergedBits.grpADCH

#define ADCSC1_ADCH0_MASK               0x01U
#define ADCSC1_ADCH1_MASK               0x02U
#define ADCSC1_ADCH2_MASK               0x04U
#define ADCSC1_ADCH3_MASK               0x08U
#define ADCSC1_ADCH4_MASK               0x10U
#define ADCSC1_AIEN_MASK                0x40U
#define ADCSC1_COCO_MASK                0x80U
#define ADCSC1_ADCH_MASK                0x1FU
#define ADCSC1_ADCH_BITNUM              0x00U


/*** ADCCFG1 - Configuration Register 1; 0x00000012 ***/
typedef union {
  byte Byte;
  struct {
    byte ADICLK0     :1;                                       /* Input Clock Select Bit 0 */
    byte ADICLK1     :1;                                       /* Input Clock Select Bit 1 */
    byte MODE0       :1;                                       /* Conversion Mode Selection Bit 0 */
    byte MODE1       :1;                                       /* Conversion Mode Selection Bit 1 */
    byte ADLSMP      :1;                                       /* Long Sample Time Configuration */
    byte ADIV0       :1;                                       /* Clock Divide Select Bit 0 */
    byte ADIV1       :1;                                       /* Clock Divide Select Bit 1 */
    byte ADLPC       :1;                                       /* Low Power Configuration */
  } Bits;
  struct {
    byte grpADICLK :2;
    byte grpMODE :2;
    byte         :1;
    byte grpADIV :2;
    byte         :1;
  } MergedBits;
} ADCCFG1STR;
extern volatile ADCCFG1STR _ADCCFG1 @0x00000012;
#define ADCCFG1                         _ADCCFG1.Byte
#define ADCCFG1_ADICLK0                 _ADCCFG1.Bits.ADICLK0
#define ADCCFG1_ADICLK1                 _ADCCFG1.Bits.ADICLK1
#define ADCCFG1_MODE0                   _ADCCFG1.Bits.MODE0
#define ADCCFG1_MODE1                   _ADCCFG1.Bits.MODE1
#define ADCCFG1_ADLSMP                  _ADCCFG1.Bits.ADLSMP
#define ADCCFG1_ADIV0                   _ADCCFG1.Bits.ADIV0
#define ADCCFG1_ADIV1                   _ADCCFG1.Bits.ADIV1
#define ADCCFG1_ADLPC                   _ADCCFG1.Bits.ADLPC
#define ADCCFG1_ADICLK                  _ADCCFG1.MergedBits.grpADICLK
#define ADCCFG1_MODE                    _ADCCFG1.MergedBits.grpMODE
#define ADCCFG1_ADIV                    _ADCCFG1.MergedBits.grpADIV

#define ADCCFG1_ADICLK0_MASK            0x01U
#define ADCCFG1_ADICLK1_MASK            0x02U
#define ADCCFG1_MODE0_MASK              0x04U
#define ADCCFG1_MODE1_MASK              0x08U
#define ADCCFG1_ADLSMP_MASK             0x10U
#define ADCCFG1_ADIV0_MASK              0x20U
#define ADCCFG1_ADIV1_MASK              0x40U
#define ADCCFG1_ADLPC_MASK              0x80U
#define ADCCFG1_ADICLK_MASK             0x03U
#define ADCCFG1_ADICLK_BITNUM           0x00U
#define ADCCFG1_MODE_MASK               0x0CU
#define ADCCFG1_MODE_BITNUM             0x02U
#define ADCCFG1_ADIV_MASK               0x60U
#define ADCCFG1_ADIV_BITNUM             0x05U


/*** ADCCFG2 - Configuration Register 2; 0x00000013 ***/
typedef union {
  byte Byte;
  struct {
    byte ADLSTS0     :1;                                       /* Long Sample Time Select Bit 0 */
    byte ADLSTS1     :1;                                       /* Long Sample Time Select Bit 1 */
    byte ADHSC       :1;                                       /* High Speed Configuration */
    byte ADACKEN     :1;                                       /* Asynchronous Clock Output Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpADLSTS :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCCFG2STR;
extern volatile ADCCFG2STR _ADCCFG2 @0x00000013;
#define ADCCFG2                         _ADCCFG2.Byte
#define ADCCFG2_ADLSTS0                 _ADCCFG2.Bits.ADLSTS0
#define ADCCFG2_ADLSTS1                 _ADCCFG2.Bits.ADLSTS1
#define ADCCFG2_ADHSC                   _ADCCFG2.Bits.ADHSC
#define ADCCFG2_ADACKEN                 _ADCCFG2.Bits.ADACKEN
#define ADCCFG2_ADLSTS                  _ADCCFG2.MergedBits.grpADLSTS

#define ADCCFG2_ADLSTS0_MASK            0x01U
#define ADCCFG2_ADLSTS1_MASK            0x02U
#define ADCCFG2_ADHSC_MASK              0x04U
#define ADCCFG2_ADACKEN_MASK            0x08U
#define ADCCFG2_ADLSTS_MASK             0x03U
#define ADCCFG2_ADLSTS_BITNUM           0x00U


/*** ADCR - Data Result Register; 0x00000014 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRH - Data Result High Register; 0x00000014 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpD_8 :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ADCRHSTR;
    #define ADCRH                       _ADCR.Overlap_STR.ADCRHSTR.Byte
    #define ADCRH_D8                    _ADCR.Overlap_STR.ADCRHSTR.Bits.D8
    #define ADCRH_D9                    _ADCR.Overlap_STR.ADCRHSTR.Bits.D9
    #define ADCRH_D10                   _ADCR.Overlap_STR.ADCRHSTR.Bits.D10
    #define ADCRH_D11                   _ADCR.Overlap_STR.ADCRHSTR.Bits.D11
    #define ADCRH_D_8                   _ADCR.Overlap_STR.ADCRHSTR.MergedBits.grpD_8
    #define ADCRH_D                     ADCRH_D_8
    
    #define ADCRH_D8_MASK               0x01U
    #define ADCRH_D9_MASK               0x02U
    #define ADCRH_D10_MASK              0x04U
    #define ADCRH_D11_MASK              0x08U
    #define ADCRH_D_8_MASK              0x0FU
    #define ADCRH_D_8_BITNUM            0x00U
    

