superdyzio/PWR-Stuff/AIR-ARR/Sterowniki Robotów/lab2/workspace/MC9S08LL64/Generated_Code/IO_Map.h
    #define IICC_RSTA_MASK              0x04U
    #define IICC_TXAK_MASK              0x08U
    #define IICC_TX_MASK                0x10U
    #define IICC_MST_MASK               0x20U
    #define IICC_IICIE_MASK             0x40U
    #define IICC_IICEN_MASK             0x80U
    
  } SameAddr_STR; /*Several registers at the same address */

} IICC1STR;
extern volatile IICC1STR _IICC1 @0x00001862;


/*** IICS - IIC Status Register; 0x00001863 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Receive Acknowledge */
    byte IICIF       :1;                                       /* IIC Interrupt Flag */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte ARBL        :1;                                       /* Arbitration Lost */
    byte BUSY        :1;                                       /* Bus Busy */
    byte IAAS        :1;                                       /* Addressed as a Slave */
    byte TCF         :1;                                       /* Transfer Complete Flag */
  } Bits;
} IICSSTR;
extern volatile IICSSTR _IICS @0x00001863;
#define IICS                            _IICS.Byte
#define IICS_RXAK                       _IICS.Bits.RXAK
#define IICS_IICIF                      _IICS.Bits.IICIF
#define IICS_SRW                        _IICS.Bits.SRW
#define IICS_ARBL                       _IICS.Bits.ARBL
#define IICS_BUSY                       _IICS.Bits.BUSY
#define IICS_IAAS                       _IICS.Bits.IAAS
#define IICS_TCF                        _IICS.Bits.TCF

#define IICS_RXAK_MASK                  0x01U
#define IICS_IICIF_MASK                 0x02U
#define IICS_SRW_MASK                   0x04U
#define IICS_ARBL_MASK                  0x10U
#define IICS_BUSY_MASK                  0x20U
#define IICS_IAAS_MASK                  0x40U
#define IICS_TCF_MASK                   0x80U


/*** IICD - IIC Data I/O Register; 0x00001864 ***/
typedef union {
  byte Byte;
  struct {
    byte DATA0       :1;                                       /* IIC Data Bit 0 */
    byte DATA1       :1;                                       /* IIC Data Bit 1 */
    byte DATA2       :1;                                       /* IIC Data Bit 2 */
    byte DATA3       :1;                                       /* IIC Data Bit 3 */
    byte DATA4       :1;                                       /* IIC Data Bit 4 */
    byte DATA5       :1;                                       /* IIC Data Bit 5 */
    byte DATA6       :1;                                       /* IIC Data Bit 6 */
    byte DATA7       :1;                                       /* IIC Data Bit 7 */
  } Bits;
} IICDSTR;
extern volatile IICDSTR _IICD @0x00001864;
#define IICD                            _IICD.Byte
#define IICD_DATA0                      _IICD.Bits.DATA0
#define IICD_DATA1                      _IICD.Bits.DATA1
#define IICD_DATA2                      _IICD.Bits.DATA2
#define IICD_DATA3                      _IICD.Bits.DATA3
#define IICD_DATA4                      _IICD.Bits.DATA4
#define IICD_DATA5                      _IICD.Bits.DATA5
#define IICD_DATA6                      _IICD.Bits.DATA6
#define IICD_DATA7                      _IICD.Bits.DATA7

#define IICD_DATA0_MASK                 0x01U
#define IICD_DATA1_MASK                 0x02U
#define IICD_DATA2_MASK                 0x04U
#define IICD_DATA3_MASK                 0x08U
#define IICD_DATA4_MASK                 0x10U
#define IICD_DATA5_MASK                 0x20U
#define IICD_DATA6_MASK                 0x40U
#define IICD_DATA7_MASK                 0x80U


/*** IICC2 - IIC Control Register 2; 0x00001865 ***/
typedef union {
  byte Byte;
  struct {
    byte AD8         :1;                                       /* Slave Address Bit 8 */
    byte AD9         :1;                                       /* Slave Address Bit 9 */
    byte AD10        :1;                                       /* Slave Address Bit 10 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ADEXT       :1;                                       /* Address Extension */
    byte GCAEN       :1;                                       /* General Call Address Enable */
  } Bits;
  struct {
    byte grpAD_8 :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IICC2STR;
extern volatile IICC2STR _IICC2 @0x00001865;
#define IICC2                           _IICC2.Byte
#define IICC2_AD8                       _IICC2.Bits.AD8
#define IICC2_AD9                       _IICC2.Bits.AD9
#define IICC2_AD10                      _IICC2.Bits.AD10
#define IICC2_ADEXT                     _IICC2.Bits.ADEXT
#define IICC2_GCAEN                     _IICC2.Bits.GCAEN
#define IICC2_AD_8                      _IICC2.MergedBits.grpAD_8
#define IICC2_AD                        IICC2_AD_8

#define IICC2_AD8_MASK                  0x01U
#define IICC2_AD9_MASK                  0x02U
#define IICC2_AD10_MASK                 0x04U
#define IICC2_ADEXT_MASK                0x40U
#define IICC2_GCAEN_MASK                0x80U
#define IICC2_AD_8_MASK                 0x07U
#define IICC2_AD_8_BITNUM               0x00U


/*** ADCCV - Compare Value Register; 0x00001880 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCCVH - Compare Value High Register; 0x00001880 ***/
    union {
      byte Byte;
      struct {
        byte CV8         :1;                                       /* Compare Function Value Bit 8 */
        byte CV9         :1;                                       /* Compare Function Value Bit 9 */
        byte CV10        :1;                                       /* Compare Function Value Bit 10 */
        byte CV11        :1;                                       /* Compare Function Value Bit 11 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpCV_8 :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ADCCVHSTR;
    #define ADCCVH                      _ADCCV.Overlap_STR.ADCCVHSTR.Byte
    #define ADCCVH_CV8                  _ADCCV.Overlap_STR.ADCCVHSTR.Bits.CV8
    #define ADCCVH_CV9                  _ADCCV.Overlap_STR.ADCCVHSTR.Bits.CV9
    #define ADCCVH_CV10                 _ADCCV.Overlap_STR.ADCCVHSTR.Bits.CV10
    #define ADCCVH_CV11                 _ADCCV.Overlap_STR.ADCCVHSTR.Bits.CV11
    #define ADCCVH_CV_8                 _ADCCV.Overlap_STR.ADCCVHSTR.MergedBits.grpCV_8
    #define ADCCVH_CV                   ADCCVH_CV_8
    
